### 2.2 데이터 프레임(DataFrame)

In [1]:
import numpy as np
import pandas as pd

- 생성 방법 1
    - 2차원 데이터, 컬럼, 인데스

In [5]:
df1 = pd.DataFrame(
    np.random.randint(40, 101, 12).reshape(4, 3),       # 2차원 데이터
    columns = list('XYZ'),          # 컬럼명, list('XYZ') ==> ['X','Y','Z']
    index = list('abcd')            # 인덱스
)
df1

    X   Y   Z
a  41  72  50
b  49  94  60
c  85  96  75
d  56  85  42

- 생성방법 2
    - 딕셔너리의 리스트

In [7]:
data = [
    {'X': 67, 'Y': 50, 'Z': 45},
    {'X': 72, 'Y': 88, 'Z': 79},
    {'X': 71, 'Y': 78, 'Z': 57},
    {'X': 82, 'Y': 75, 'Z': 98}
]
df2 = pd.DataFrame(data, index = list('abcd'))
df2

    X   Y   Z
a  67  50  45
b  72  88  79
c  71  78  57
d  82  75  98

- 생성방법 3
    - 데이터가 value, 컬럼명이 key가 되는 딕셔너리

In [8]:
data = {
    'X': [67, 72, 71, 82],
    'Y': [50, 88, 78, 75],
    'Z': [45, 79, 57, 98]
}
df3 = pd.DataFrame(data, index = list('abcd'))
df3

    X   Y   Z
a  67  50  45
b  72  88  79
c  71  78  57
d  82  75  98

- 여러가지 타입이 혼합된 형태의 데이터로 생성

In [9]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [15]:
df.index.name ='도시'
df.columns.name ='항목'
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [11]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [12]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [13]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object', name='도시')

In [18]:
# 연습 문제 4.1.2
# 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

# (1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

# (2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

ddf = { 
    "성": ['김', '나', '박', '이', '신'],
    "성별": ['남', '여', '남', '남', '남'],
    "키": [175, 155, 180, 173, 170],
    "몸무게": [70.5, 47.2, 77.1, 72.1, 71.9],
    "지역": ["영등포", "여의도", "강남", "잠실", "왕십리"],
}
columns = ['성','성별','키','몸무게','지역']
index = ["1",'2','3','4','5']
d_df = pd.DataFrame(ddf, index=index, columns=columns)
d_df

   성 성별    키   몸무게   지역
1  김  남  175  70.5  영등포
2  나  여  155  47.2  여의도
3  박  남  180  77.1   강남
4  이  남  173  72.1   잠실
5  신  남  170  71.9  왕십리

- 열 데이터의 갱신, 추가

In [19]:
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [20]:
df['2010-2015 증가율'] = df['2010-2015 증가율'] * 100
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [21]:
# 열 이름이 있으면 갱신, 없으면 추가
df['Eng name'] = ['Seoul','Busan','Incheon','Daegu']
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율 Eng name
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83    Seoul
부산  경상권  3448737  3393191  3512547  3655437           1.63    Busan
인천  수도권  2890451  2632035  2517680  2466338           9.82  Incheon
대구  경상권  2466052  2431774  2456016  2473990           1.41    Daegu

- 열 삭제

In [22]:
del df['2000']
df

항목   지역     2015     2010     2005  2010-2015 증가율 Eng name
도시
서울  수도권  9904312  9631482  9762546           2.83    Seoul
부산  경상권  3448737  3393191  3512547           1.63    Busan
인천  수도권  2890451  2632035  2517680           9.82  Incheon
대구  경상권  2466052  2431774  2456016           1.41    Daegu

In [23]:
df.drop(columns=['2005','2010'], inplace= True)
df

항목   지역     2015  2010-2015 증가율 Eng name
도시
서울  수도권  9904312           2.83    Seoul
부산  경상권  3448737           1.63    Busan
인천  수도권  2890451           9.82  Incheon
대구  경상권  2466052           1.41    Daegu

In [24]:
# 행을 지울 때
df.drop(['대구'], inplace=True)
df

항목   지역     2015  2010-2015 증가율 Eng name
도시
서울  수도권  9904312           2.83    Seoul
부산  경상권  3448737           1.63    Busan
인천  수도권  2890451           9.82  Incheon

- 열 인덱싱

In [25]:
# 열 이름을 하나만 선택하면 시리즈 반환
df['지역']

도시
서울    수도권
부산    경상권
인천    수도권
Name: 지역, dtype: object

In [26]:
# 열 이름이 리스트로 감싸져 있으면 데이터프레임 반환
df[['지역','Eng name']]

항목   지역 Eng name
도시
서울  수도권    Seoul
부산  경상권    Busan
인천  수도권  Incheon

- 개별 인덱싱

In [27]:
# 데이터프레임[열 이름][행 인덱스]
df['지역']['서울'], df['지역'].서울, df.지역['서울'], df.지역.서울

('수도권', '수도권', '수도권', '수도권')

In [ ]:
# 컬럼명이 숫자로 시작하거나 공백이 있는 경우에는 . 컬럼명을 사용할 수 없음
# ex)   df.2015[서울], df.Eng nmae

In [29]:
# 연습 문제 4.1.3
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [30]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df.수학

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [31]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [50]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df['평균'] = round(df.mean(axis=1), 1)
df

    국어  영어  수학    평균
춘향  80  90  90  86.8
몽룡  90  70  60  73.2
향단  70  60  80  70.0
방자  30  40  70  46.8

In [55]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df['영어']['방자'] = 80
df['평균'] = round(df.mean(axis=1), 1)
df

C:\Users\human\AppData\Local\Temp\ipykernel_1112\1214125003.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['영어']['방자'] = 80

    국어  영어  수학    평균
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  60  80  70.0
방자  30  80  70  56.7

In [65]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df[:1]

    국어  영어  수학    평균
춘향  80  90  90  86.7

In [66]:
# (6) 향단의 점수를 시리즈로 나타낸다.
pd.Series(list(df[2:3].values), index =["향단"])

향단    [70.0, 60.0, 80.0, 70.0]
dtype: object